import os

APP_BASE_URL = os.getenv(
    "APP_BASE_URL",
    "https://soska-wheel-app-production.up.railway.app",
)

BOT_TOKEN = os.getenv("BOT_TOKEN")

WEBAPP_URL = os.getenv(
    "WEBAPP_URL",
    f"{APP_BASE_URL}/static/index.html?v=31",
)

ADMINS: set[int] = {
    5480082089,
}

CHANNEL_USERNAME = "@soska_bar"
CHANNEL_URL = "https://t.me/soska_bar"

SPIN_COOLDOWN_DAYS = 7

# Версія призового фонду.
# Якщо змінюємо призи / кількість / ваги — міняємо версію.
# Це знадобиться в database.py, щоб база не тримала старі залишки.
PRIZE_POOL_VERSION = "2026-06-25-prize-pool-v2"

# ПОРЯДОК СЕКТОРІВ = ЯК НА КОЛЕСІ
# ВІД ВЕРХУ ЗА ГОДИННИКОВОЮ
PRIZES_ = [
    {
        "sector_index": 0,
        "prize": "Vaporesso XROS Mini",
        "stock": 2,
        "weight": 1,
    },
    {
        "sector_index": 1,
        "prize": "OXVA XLIM GO KIT",
        "stock": 2,
        "weight": 1,
    },
    {
        "sector_index": 2,
        "prize": "POD Система IBAR Smart Pod Carbon",
        "stock": 1,
        "weight": 1,
    },
    {
        "sector_index": 3,
        "prize": "Нічого",
        "stock": None,
        "weight": 500,
    },
    {
        "sector_index": 4,
        "prize": "Vaporesso XROS 5 MINI",
        "stock": 2,
        "weight": 1,
    },
    {
        "sector_index": 5,
        "prize": "OXVA XLIM GO Lite",
        "stock": 2,
        "weight": 1,
    },
]

PRANK_USER_IDS: set[int] = {
    642600326,
    1092942921,
    5363135627,
    893867190,
    805855565,
    6819111536,
    1133782880,
    641997467,
    606790387,
    702691829,
    7989447737,
    5064257026,
    1145960399,
    945642666,
    1219650006,
    888912540,
    6175181724,
    897918098,
    8257088897,
    5433766731,
    998210357,
    798214710,
    8254011313,
    1322850277,
    553773613,
    608114854,
    7138282371,
    8530929396,
    658718584,
    950658702,
    1980797950,
    6552341892,
    1584070463,
    821063512,
    5348973888,
    949168781,
    1259008457,
    1652544557,
    1021702373,
    934882514,
    1389239448,
    1448133082,
    738286187,
    1127219597,
    664294976,
    673714690,
    8281856300,
    1342527164,
    826206783,
    885914578,
    7496788849,
    727015354,
    1542596808,
    913283672,
    337138669,
    1031878912,
    7548003451,
    7856872454,
    600726426,
    752687585,
    958520943,
    644643013,
    739950394,
    6175135864,
    1738970893,
    8474389088,
    1362636018,
    888207629,
    712354023,
    583921324,
    1160582459,
    6500538581,
    965853400,
    1110632064,
    708854785,
    8619181545,
    688049521,
    5519673457,
    859034521,
    521897969,
    8363113345,
    1076276803,
    800373083,
    832022911,
    1467938572,
    8567602157,
    1681259340,
    882453888,
    976918368,
}

PRANK_TEXT = "Хахах, попався шпіоніро ))"
PRANK_SECTOR_INDEX = 3